const riskQuestions = [
  {
    id: 1,
    text: 'ข้อที่ 1. ปัจจุบันคุณกำลังอยู่ในช่วงชีวิตใด',
    options: ['อายุยังไม่เกิน 30 ปี เริ่มต้นทำงาน เก็บเงินเก็บทอง', 
        'อายุเกิน 30 แต่ไม่เกิน 55 ปี อยู่ในวัยทำงาน มีเงินเก็บเงินก้อน', 
        'อายุเกิน 55 ปี ใกล้เกษียณอยากพักผ่อน'],
  },
  {
    id: 2,
    text: 'ข้อที่ 2. ในเรื่องการลงทุนเมื่อพูดถึง “ความผันผวน” คุณนึกถึงอะไรเป็นอันดับแรก',
    options: ['นี่แหละโอกาสทอง ขึ้นก็ขาย ลงก็ซื้อ ได้กำไรตั้งหลายรอบ', 'ที่ไหนมีความผันผวน ที่นั่นมีความไม่แน่นอน'
        , 'แย่แล้วถ้าราคาตก ก็ขาดทุนสิ!!'],
  },
  {
    id: 3,
    text: 'ข้อที่ 3. สไตล์การลงทุนที่ผ่านมาของคุณเป็นแบบไหน (ถ้ายังไม่เคยลงทุน ลองเลือกแบบที่ชอบดูสิ)',
    options: ['กล้าได้กล้าเสีย ถึงเวลาต้องยอมตัดขาดทุน แล้วไปลุยใหม่ สร้างกำไรสูงๆ',
        'แล้วแต่จังหวะ แล้วแต่โอกาส บางทีก็เสี่ยงบ้างมีกำไรพอประมาณ',
        'ช้าแต่ชัวร์ ได้น้อยดีกว่าไม่ได้ แต่ไม่อยากขาดทุน'],
  },
  {
    id: 4,
    text: 'ข้อที่ 4. หากลงทุนแล้วขาดทุน อะไรคือสาเหตุในความคิดของคุณ',
    options: ['การตัดสินใจที่ผิดพลาดของตัวเรา',
        'เป็นเพราะความไม่แน่นอนของตลาดและภาวะการลงทุน',
        'ทั้งตัวเราและภาวะการลงทุน'],
  },
  {
    id: 5,
    text: 'ข้อที่ 5. ลองหลับตาแล้วมองไปข้างหน้าในอีก 1 ปี คุณอยากเห็นอะไรจากเงินลงทุน',
    options: ['ผลตอบแทนแน่นอน 5%',
        'หวังกำไรถึง 10% แต่ถ้าโชคไม่ดีขาดทุนก็ยอมได้ 5%',
        'หวังกำไรถึง 20% แต่ถ้าโชคไม่ดีขาดทุนก็ยอมได้ 10%'],
  },
];

export default riskQuestions;