type QuestionData = {
  id: number;
  text: string;
  options: string[];
};

const riskQuestions:QuestionData[] = [
  {
    id: 1,
    text: 'ข้อที่ 1. ปัจจุบันคุณอายุ',
    options: ['มากกว่า 55 ปี', 
        '45 - 55 ปี', 
        '35 - 44 ปี',
        'น้อยกว่า 35 ปี'],
  },
  {
    id: 2,
    text: 'ข้อที่ 2. ปัจจุบันคุณมีภาระทางการเงินและค่าใช้จ่ายประจำ เช่น ค่าผ่อนบ้าน รถ ค่าใช้จ่ายส่วนตัว และค่าเลี้ยงดูครอบครัว',
    options: ['มากกว่า 75%', '51% - 75%'
        , '25% - 50%', 'น้อยกว่า 25%'],
  },
  {
    id: 3,
    text: 'ข้อที่ 3. คุณมีสถานภาพทางการเงินในปัจจุบันอย่างไร',
    options: ['มีทรัพย์สินน้อยกว่าหนี้สิน',
        'มีทรัพย์สินเท่ากับหนี้สิน',
        'มีทรัพย์สินมากกว่าหนี้สิน',
        'มีความมั่นใจว่ามีเงินออม/เงินลงทุนเพียงพอสำหรับการใช้ชีวิตหลังเกษียณแล้ว'],
  },
  {
    id: 4,
    text: 'ข้อที่ 4. คุณเคยมีประสบการณ์ หรือมีความรู้ในการลงทุนในทรัพย์สินกลุ่มใดต่อไปนี้บ้าง (เลือกได้มากกว่า 1 ข้อ)',
    options: ['เงินฝากธนาคาร',
        'พันธบัตรรัฐบาล หรือกองทุนรวมพันธบัตรรัฐบาล',
        'หุ้นกู้ หรือกองทุนรวมตราสารหนี้',
        'หุ้นสามัญ หรือกองทุนรวมหุ้น หรือสินทรัพย์อื่นที่มีความเสี่ยงสูง'],
  },
  {
    id: 5,
    text: 'ข้อที่ 5. ระยะเวลาที่คุณคาดว่าจะไม่มีความจำเป็นต้องใช้เงินลงทุนนี้',
    options: ['ไม่เกิน 1 ปี',
        '1 - 3 ปี',
        '3 - 5 ปี',
        'มากกว่า 5 ปี'],
  },
  {
    id: 6,
    text: 'ข้อที่ 6. วัตถุประสงค์หลักในการลงทุนของคุณ คือ',
    options: ['เน้นเงินต้นต้องปลอดภัยและได้รับผลตอบแทนสม่ำเสมอแต่ต่ำได้',
        'เน้นโอกาสได้รับผลตอบแทนที่สม่ำเสมอ แต่อาจเสี่ยงที่จะสูญเสียเงินต้นได้บ้าง',
        'เน้นโอกาสได้รับผลตอบแทนที่สูงขึ้น แต่อาจเสี่ยงที่จะสูญเสียเงินต้นได้มากขึ้น',
        'เน้นผลตอบแทนสูงสุดในระยะยาว แต่อาจเสี่ยงที่จะสูญเสียเงินต้นส่วนใหญ่ได้'],
  },
  {
    id: 7,
    text: 'ข้อที่ 7. เมื่อพิจารณาตัวอย่างผลตอบแทนของกลุ่มการลงทุนที่อาจเกิดขึ้นด้านล่าง คุณเต็มใจที่จะลงทุนในกลุ่มการลงทุนใด',
    options: ['แบบที่ 1 มีโอกาสได้รับผลตอบแทนสูงสุด 2.5% โดยไม่ขาดทุนเลย',
        'แบบที่ 2 มีโอกาสได้รับผลตอบแทนสูงสุด 7% แต่อาจขาดทุนได้ถึง 1%',
        'แบบที่ 3 มีโอกาสได้รับผลตอบแทนสูงสุด 15% แต่อาจขาดทุนได้ถึง 5%',
        'แบบที่ 4 มีโอกาสได้รับผลตอบแทนสูงสุด 25% แต่อาจขาดทุนได้ถึง 15%'],
  },
  {
    id: 8,
    text: 'ข้อที่ 8. ถ้าคุณเลือกลงทุนในทรัพย์สินที่มีโอกาสได้รับผลตอบแทนมาก แต่มีโอกาสขาดทุนสูงด้วยเช่นกัน คุณจะรู้สึกอย่างไร',
    options: ['กังวลและตื่นตระหนกกลัวขาดทุน',
        'ไม่สบายใจแต่พอเข้าใจได้บ้าง',
        'เข้าใจและรับความผันผวนได้ในระดับหนึ่ง',
        'ไม่กังวลกับโอกาสขาดทุนสูง และหวังกับผลตอบแทนที่อาจจะได้รับสูงขึ้น'],
  },
  {
    id: 9,
    text: 'ข้อที่ 9. คุณจะรู้สึกกังวล/รับไม่ได้ เมื่อมูลค่าเงินลงทุนของคุณมีการปรับตัวลดลงในสัดส่วนเท่าใด',
    options: ['5% หรือน้อยกว่า',
        '5% - 10%',
        '10% - 20%',
        'มากกว่า 20%'],
  },
  {
    id: 10,
    text: 'ข้อที่ 10. หากปีที่แล้วคุณลงทุนไป 100,000 บาท ปีนี้คุณพบว่ามูลค่าเงินลงทุนลดลงเหลือ 85,000 บาท คุณจะทำอย่างไร',
    options: ['ตกใจ และต้องการขายการลงทุนที่เหลือทิ้ง',
        'กังวลใจ และจะปรับเปลี่ยนการลงทุนบางส่วนไปในทรัพย์สินที่เสี่ยงน้อยลง',
        'อดทนถือต่อเพื่อรอผลตอบแทนปรับตัวกลับมา',
        'ไม่กังวลใจ เพราะเข้าใจในการลงทุนระยะยาวและอาจเพิ่มเงินลงทุนในแบบเดิมเพื่อเฉลี่ยต้นทุน'],
  },
];

export default riskQuestions;